# SetDefaultLengthUnit Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseImportOptions..::..SetDefaultLengthUnit Method
BaseImportOptions Class See Also
---
Set the default length unit used for importing unitless files.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022.1
# Syntax
C#
---
```text
public void SetDefaultLengthUnit(
	ForgeTypeId specTypeId
)
```

Visual Basic
---
```text
Public Sub SetDefaultLengthUnit ( _
	specTypeId As ForgeTypeId _
)
```

Visual C++
---
```text
public:
void SetDefaultLengthUnit(
	ForgeTypeId^ specTypeId
)
```

# ### Parameters
specTypeId
    Type: Autodesk.Revit.DB..::..ForgeTypeId The default length unit.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given specTypeId is not a supported unit of length. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
BaseImportOptions Class
Autodesk.Revit.DB Namespace